#!/usr/bin/env bash
# 1_动手_是学些编码的最简单的方式
# 2_可以从_左面的_教学手册中_拷贝_部分内容_到这里
# 3_然后_在本编辑器中_点击鼠标右键_选择_"Run Code"的_菜单选项
# 4_或者_按组合键_Alt+Ctrl+N 执行一下_看看效果
clear && echo -e "\n\n" # NOTE 清理一下屏幕内容
# NOTE 5_在下方_编写你的_练习_代码_你的代码从下面这里开始



#NOTE 6_打印点_信息
echo -e "\n\n你好,中国人,你要自信!\n恭喜你啊!\n你的_命令_已经被_成功地_执行!\n加油啊,你正在走入星辰大海!\n\n"


# ==========================================================
# REVIEW 下面是注释_不会被执行
# 15_grasspy.cn
# 16_草蟒极速 QQ 交流群:760167264 风里雨里我们在这个QQ群里等你 快来吧,大家一起快乐的聊天吧!
# 来聊聊,中西如何互为借鉴,砥砺前行,中西合璧,走进新时代,实践全球化的命运共同体

# NOTE 多种_运行_方法_下面的每种方法_都是独立进行的
# d01_点击右上角的_白色三角形_就可以_执行简单的_草蟒中文grasspy版本的python
# d02_在本编辑器中_点击鼠标右键_选择_"Run Code"的_菜单选项
# d03_在本编辑器中_按组合键_Alt+Ctrl+N
# d04_cloudstudio的终端中,直接运行类似如下的命令,直接执行.例如 python 18_打开文件.py
# ==========================================================
