#!/usr/bin/env bash
# NOTE 在下方_编写你的_练习_代码
# TODO 动手_是学些编码的最简单的方式
# TODO 可以从_左面的_教学手册中_拷贝_部分内容_到这里
# TODO 然后_在本编辑器中_点击鼠标右键_选择_"Run Code"的_菜单选项
# TODO 或者_按组合键_Alt+Ctrl+N 执行一下_看看效果

# NOTE 清理一下屏幕内容_打印点_信息
clear && echo -e "\n\n"
echo -e "你好中国"
# NOTE 下面是换行
echo -e "\n\n"


# ==========================================================
# REVIEW 下面是注释_不会被执行
# grasspy.cn
# 草蟒极速 QQ 交流群：760167264 风里雨里我们在这个QQ群里等你 快来吧,大家一起快乐的聊天吧!
# 来聊聊,中西如何互为借鉴,砥砺前行,中西合璧,走进新时代,实践全球化的命运共同体

# NOTE 多种_运行_方法_下面的每种方法_都是独立进行的
# REVIEW 这个方法是优选的 01_点击右上角的_白色三角形_就可以_执行简单的_草蟒中文grasspy版本的python
# 02_在本编辑器中_点击鼠标右键_选择_"Run Code"的_菜单选项
# 03_在本编辑器中_按组合键_Alt+Ctrl+N
# 04_cloudstudio的终端中,直接运行类似如下的命令,直接执行.例如 python 18_打开文件.py
# ==========================================================

